#include <iostream>
#include <stdio.h>


using namespace std;
int printx();

int main()
{
	setlocale(0, "");
	cout << "Привет, эта игра - Крестики-нолики\n" <<
		"рассказывать полностью правила не буду,\n" <<
		"вводите числа от 1 до 9,а там разберетесь, удачи!\n";
	printx();


	return 0;
}

int printx()
{
	int a;
	int i = 1;
	char x1(' ');
	char x2(' ');
	char x3(' ');
	char x4(' ');
	char x5(' ');
	char x6(' ');
	char x7(' ');
	char x8(' ');
	char x9(' ');

	cout << "*************\n";
	cout << "*   *   *   *\n";
	cout << "* " << x7 << " * " 
				 << x8 << " * " 
				 << x9 << " *\n";
	cout << "*   *   *   *\n";
	cout << "*************\n";
	cout << "*   *   *   *\n";
	cout << "* " << x4 << " * " <<
					x5 << " * " <<
					x6 << " *\n";
	cout << "*   *   *   *\n";
	cout << "*************\n";
	cout << "*   *   *   *\n";
	cout << "* " << x1 << " * " <<
					x2 << " * " <<
					x3 << " *\n";
	cout << "*   *   *   *\n";
	cout << "*************\n";

	while (i < 10)
	{
		cin >> a;

		if (a == 1 && i % 2 == 1)
			x1 = 'x';
		if (a == 1 && i % 2 == 0)
			x1 = '0';
		if (a == 2 && i % 2 == 1)
			x2 = 'x';
		if (a == 2 && i % 2 == 0)
			x2 = '0';
		if (a == 3 && i % 2 == 1)
			x3 = 'x';
		if (a == 3 && i % 2 == 0)
			x3 = '0';
		if (a == 4 && i % 2 == 1)
			x4 = 'x';
		if (a == 4 && i % 2 == 0)
			x4 = '0';
		if (a == 5 && i % 2 == 1)
			x5 = 'x';
		if (a == 5 && i % 2 == 0)
			x5 = '0';
		if (a == 6 && i % 2 == 1)
			x6 = 'x';
		if (a == 6 && i % 2 == 0)
			x6 = '0';
		if (a == 7 && i % 2 == 1)
			x7 = 'x';
		if (a == 7 && i % 2 == 0)
			x7 = '0';
		if (a == 8 && i % 2 == 1)
			x8 = 'x';
		if (a == 8 && i % 2 == 0)
			x8 = '0';
		if (a == 9 && i % 2 == 1)
			x9 = 'x';
		if (a == 9 && i % 2 == 0)
			x9 = '0';

		cout << "*************\n";
		cout << "*   *   *   *\n";
		cout << "* " << x7 << " * "
			<< x8 << " * "
			<< x9 << " *\n";
		cout << "*   *   *   *\n";
		cout << "*************\n";
		cout << "*   *   *   *\n";
		cout << "* " << x4 << " * " <<
			x5 << " * " <<
			x6 << " *\n";
		cout << "*   *   *   *\n";
		cout << "*************\n";
		cout << "*   *   *   *\n";
		cout << "* " << x1 << " * " <<
			x2 << " * " <<
			x3 << " *\n";
		cout << "*   *   *   *\n";
		cout << "*************\n";

		++i;


	}
	return 0;
}




