/* Халупа Платон Александрович 19.10.2021г.
Крестики- нолики*/

#include <iostream>
#include <stdio.h>


using namespace std;
int printx();

int main()
{
	setlocale(0, "");
	cout << "Привет, эта игра - Крестики-нолики\n" <<
		"рассказывать полностью правила не буду,\n" <<
		"вводите числа от 1 до 9,а там разберетесь, удачи!\n";
	printx();


	return 0;
}

int printx()
{

	string x[9] = { " ", " ", " ", " ", " ", " ", " ", " ", " " };  // крестики или нолики


	cout << "*************\n";
	cout << "*   *   *   *\n";
	cout << "* " << x[6] << " * "
		<< x[7] << " * "
		<< x[8] << " *\n";
	cout << "*   *   *   *\n";
	cout << "*************\n";
	cout << "*   *   *   *\n";
	cout << "* " << x[3] << " * " <<
		x[4] << " * " <<
		x[5] << " *\n";
	cout << "*   *   *   *\n";
	cout << "*************\n";
	cout << "*   *   *   *\n";
	cout << "* " << x[0] << " * " <<
		x[1] << " * " <<
		x[2] << " *\n";
	cout << "*   *   *   *\n";
	cout << "*************\n";

	


	int a;                // числа(от 1 до 9), которые вводят пользователи по очереди
	int i = 0;			  // 	
	int y;

	while (i < 10)
	{
		cin >> a;

		for (int y = 0; y < 9; y++)				// проверка на нолик

			if (a == y + 1 && i % 2 == 0)
				x[y] = "x";

		for (int y = 0; y < 9; y++)				// проверка на крестик

			if (a == y + 1 && i % 2 == 1)
				x[y] = "0";

		cout << "*************\n";
		cout << "*   *   *   *\n";
		cout << "* " << x[6] << " * "
			<< x[7] << " * "
			<< x[8] << " *\n";
		cout << "*   *   *   *\n";
		cout << "*************\n";
		cout << "*   *   *   *\n";
		cout << "* " << x[3] << " * " <<
			x[4] << " * " <<
			x[5] << " *\n";
		cout << "*   *   *   *\n";
		cout << "*************\n";
		cout << "*   *   *   *\n";
		cout << "* " << x[0] << " * " <<
			x[1] << " * " <<
			x[2] << " *\n";
		cout << "*   *   *   *\n";
		cout << "*************\n";

		if (x[6] == "x" && x[7] == "x" && x[8] == "x")    
			cout << " Крестики выиграли !!!";
		if (x[3] == "x" && x[4] == "x" && x[5] == "x")
			cout << " Крестики выиграли !!!";
		if (x[0] == "x" && x[1] == "x" && x[2] == "x")
			cout << " Крестики выиграли !!!";
		if (x[6] == "x" && x[3] == "x" && x[0] == "x")
			cout << " Крестики выиграли !!!";
		if (x[7] == "x" && x[4] == "x" && x[1] == "x")
			cout << " Крестики выиграли !!!";
		if (x[8] == "x" && x[5] == "x" && x[2] == "x")
			cout << " Крестики выиграли !!!";
		if (x[0] == "x" && x[4] == "x" && x[8] == "x")
			cout << " Крестики выиграли !!!";
		if (x[6] == "x" && x[4] == "x" && x[2] == "x")
			cout << " Крестики выиграли !!!";

		if (x[6] == "0" && x[7] == "0" && x[8] == "0")
			cout << " Нолики  выиграли !!!";
		if (x[3] == "0" && x[4] == "0" && x[5] == "0")
			cout << " Нолики  выиграли !!!";
		if (x[0] == "0" && x[1] == "0" && x[2] == "0")
			cout << " Нолики  выиграли !!!";
		if (x[6] == "0" && x[3] == "0" && x[0] == "0")
			cout << " Нолики  выиграли !!!";
		if (x[7] == "0" && x[4] == "0" && x[1] == "0")
			cout << " Нолики  выиграли !!!";
		if (x[8] == "0" && x[5] == "0" && x[2] == "0")
			cout << " Нолики  выиграли !!!";
		if (x[0] == "0" && x[4] == "0" && x[8] == "0")
			cout << " Нолики  выиграли !!!";
		if (x[6] == "0" && x[4] == "0" && x[2] == "0")
			cout << " Нолики выиграли !!!";


		++i;

		
	}
	return 0;
}




